export const studentList: AStudent[] = [
  { name: "홍길동", class: "파닉스반", status: "학원가는길", phone: ["010", "1293", "0192"] },
  { name: "김길동", class: "파닉스반", status: "학원가는길", phone: ["010", "1293", "1234"] },
  { name: "박길동", class: "파닉스반", status: "학원가는길", phone: ["010", "1293", "4123"] },
  { name: "이길동", class: "파닉스반", status: "학원가는길", phone: ["010", "1293", "5142"] },
  { name: "최길동", class: "파닉스반", status: "학원가는길", phone: ["010", "1293", "9861"] },
  { name: "정길동", class: "파닉스반", status: "학원가는길", phone: ["010", "1293", "1313"] },
  { name: "전길동", class: "파닉스반", status: "학원가는길", phone: ["010", "1293", "2424"] },
  { name: "윤길동", class: "파닉스반", status: "학원가는길", phone: ["010", "1293", "7979"] },
  { name: "안길동", class: "파닉스반", status: "학원가는길", phone: ["010", "1293", "8484"] },
  { name: "남궁길동", class: "파닉스반", status: "학원가는길", phone: ["010", "1293", "3863"] },

  { name: "홍길동2", class: "초5반", status: "학원가는길", phone: ["010", "1293", "1367"] },
  { name: "김길동2", class: "초5반", status: "학원가는길", phone: ["010", "1293", "4567"] },
  { name: "박길동2", class: "초5반", status: "학원가는길", phone: ["010", "1293", "1351"] },
  { name: "이길동2", class: "초5반", status: "학원가는길", phone: ["010", "1293", "1331"] },
  { name: "최길동2", class: "초5반", status: "학원가는길", phone: ["010", "1293", "1133"] },
  { name: "정길동2", class: "초5반", status: "학원가는길", phone: ["010", "1293", "1111"] },
  { name: "전길동2", class: "초5반", status: "학원가는길", phone: ["010", "1293", "2222"] },
  { name: "윤길동2", class: "초5반", status: "학원가는길", phone: ["010", "1293", "3333"] },
  { name: "안길동2", class: "초5반", status: "학원가는길", phone: ["010", "1293", "4444"] },
  { name: "남궁길동2", class: "초5반", status: "학원가는길", phone: ["010", "1293", "5555"] },

  { name: "남궁길동3", class: "초6반", status: "학원가는길", phone: ["010", "1293", "9999"] },
  { name: "안길동3", class: "초6반", status: "학원가는길", phone: ["010", "1293", "9990"] },
  { name: "윤길동3", class: "초6반", status: "학원가는길", phone: ["010", "1293", "9998"] },
  { name: "전길동3", class: "초6반", status: "학원가는길", phone: ["010", "1293", "9997"] },
  { name: "정길동3", class: "초6반", status: "학원가는길", phone: ["010", "1293", "9996"] },
  { name: "최길동3", class: "초6반", status: "학원가는길", phone: ["010", "1293", "9994"] },
  { name: "이길동3", class: "초6반", status: "학원가는길", phone: ["010", "1293", "9995"] },
  { name: "박길동3", class: "초6반", status: "학원가는길", phone: ["010", "1291", "9993"] },
  { name: "김길동3", class: "초6반", status: "학원가는길", phone: ["010", "1293", "9999"] },
  { name: "홍길동3", class: "초6반", status: "학원가는길", phone: ["010", "1293", "9991"] },

  { name: "남궁길동4", class: "중1반", status: "학원가는길", phone: ["010", "1293", "5550"] },
  { name: "안길동4", class: "중1반", status: "학원가는길", phone: ["010", "1293", "5559"] },
  { name: "윤길동4", class: "중1반", status: "학원가는길", phone: ["010", "1293", "5558"] },
  { name: "전길동4", class: "중1반", status: "학원가는길", phone: ["010", "1293", "5557"] },
  { name: "정길동4", class: "중1반", status: "학원가는길", phone: ["010", "1293", "5556"] },
  { name: "최길동4", class: "중1반", status: "학원가는길", phone: ["010", "1293", "5554"] },
  { name: "이길동4", class: "중1반", status: "학원가는길", phone: ["010", "1293", "5555"] },
  { name: "박길동4", class: "중1반", status: "학원가는길", phone: ["010", "1293", "5553"] },
  { name: "김길동4", class: "중1반", status: "학원가는길", phone: ["010", "1293", "5552"] },
  { name: "홍길동4", class: "중1반", status: "학원가는길", phone: ["010", "1293", "5551"] },
]

export const time_table: TimeTable[] = [
  {
    day: "월",
    schedule: [
      { time: "14:00~14:50", class: "파닉스반" },
      { time: "15:00~15:50", class: "초5반" },
      { time: "16:00~17:00", class: "초6반" },
      { time: "17:30~18:50", class: "중1반" },
      { time: "19:00~20:50", class: "중2반" },
      { time: "21:00~21:50", class: "중3반" },
    ],
  },
  {
    day: "화",
    schedule: [
      { time: "14:00~14:50", class: "파닉스반" },
      { time: "15:00~15:50", class: "초5반" },
      { time: "16:00~17:00", class: "초6반" },
      { time: "17:30~18:50", class: "중1반" },
      { time: "19:00~20:50", class: "중2반" },
      { time: "21:00~21:50", class: "중3반" },
    ],
  },
  {
    day: "수",
    schedule: [
      { time: "14:00~14:50", class: "파닉스반" },
      { time: "15:00~15:50", class: "초5반" },
      { time: "16:00~17:00", class: "초6반" },
      { time: "17:30~18:50", class: "중1반" },
      { time: "19:00~20:50", class: "중2반" },
      { time: "21:00~21:50", class: "중3반" },
    ],
  },
  {
    day: "목",
    schedule: [
      { time: "14:00~14:50", class: "파닉스반" },
      { time: "15:00~15:50", class: "초5반" },
      { time: "16:00~17:00", class: "초6반" },
      { time: "17:30~18:50", class: "중1반" },
      { time: "19:00~20:50", class: "중2반" },
      { time: "21:00~21:50", class: "중3반" },
    ],
  },
  {
    day: "금",
    schedule: [
      { time: "14:00~14:50", class: "파닉스반" },
      { time: "15:00~15:50", class: "초5반" },
      { time: "16:00~17:00", class: "초6반" },
      { time: "17:30~18:50", class: "중1반" },
      { time: "19:00~20:50", class: "중2반" },
      { time: "21:00~21:50", class: "중3반" },
    ],
  },
]

export const days: Days[] = ["일", "월", "화", "수", "목", "금", "토"]

export const classList: ClassList[] = ["파닉스반", "초5반", "초6반", "중1반", "중2반", "중3반", "고1반", "고2반"]

export const A_Status: AStatus[] = ["학원가는길", "학원도착", "출석", "결석", "조퇴", "아픔", "걍쉼", "수업끝", "남음", "귀가"]

export const timeList: TimeList[] = ["14:00 - 14:50", "15:00 - 15:50", "16:00 - 17:00", "17:30 - 18:50", "19:00 - 20:50", "21:00 - 21:50"]
